In [4]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd

In [138]:
#Q1. List any five functions of the pandas library with execution.

'''
1. read_csv() · 
2. head() · 
3. describe() .
4. loc[:] ·
5. to_datetime()

'''

'\n1. read_csv() · \n2. head() · \n3. describe() .\n4. loc[:] ·\n5. to_datetime()\n\n'

In [140]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [141]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [143]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [145]:
df.loc[:3,["Survived","Name","PassengerId"]]

   Survived                                               Name  PassengerId
0         0                            Braund, Mr. Owen Harris            1
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...            2
2         1                             Heikkinen, Miss. Laina            3
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)            4

In [146]:
df=pd.DataFrame({"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [147]:
df["Date"]=pd.to_datetime(df["Date"])

In [148]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [40]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a 
#Python function to re-index the DataFrame with a new index that starts 
#from 1 and increments by 2 for each row.

df=pd.DataFrame({"A":[1,2,3,4,5,6],"B":['a','d',[3],'d','g','f']})

In [41]:
df

   A    B
0  1    a
1  2    d
2  3  [3]
3  4    d
4  5    g
5  6    f

In [42]:
l=[]

def n_index():
    i=0;
    j=1;
    l.append(j);
    while(i<=len(df)):
        j=j+2;
        l.append(j)
        i=i+1;
    return l;

l1=n_index();

df.reindex(l1)

      A    B
1   2.0    d
3   4.0    d
5   6.0    f
7   NaN  NaN
9   NaN  NaN
11  NaN  NaN
13  NaN  NaN
15  NaN  NaN

In [43]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 
#'Values' column. The function should print the sum to the console.

'''
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50],
your function should calculate and print the sum of the first three values, which is 60.
'''

df=pd.DataFrame({"Values":[10,20,30,40,50]})
df

   Values
0      10
1      20
2      30
3      40
4      50

In [44]:
print(df['Values'][0:3].sum())

60

In [45]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function 
# to create a new column'Word_Count' that contains the number of words in each 
# row of the 'Text' column.

df=pd.DataFrame({"Text":["I am a boy",'I am learning pandas','I am going to count the number of words']})

In [46]:
df

                                      Text
0                               I am a boy
1                     I am learning pandas
2  I am going to count the number of words

In [50]:
df["Word count"]=df["Text"].apply(lambda x:len(x.split()))

In [51]:
df

                                      Text  Word count
0                               I am a boy           4
1                     I am learning pandas           4
2  I am going to count the number of words           9

In [60]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

d={"A":[1,2,3,4],"B":[5,6,7,8]}
df=pd.DataFrame(d)
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [63]:
df.size # size gives total number of values

8

In [64]:
df.shape # shape gives dimension of matrix

(4, 2)

In [70]:
#Q6. Which function of pandas do we use to read an excel file?

df=pd.read_excel("A.xlsx")

In [71]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

df=pd.DataFrame({'Email':["abc@gmail.com","def@gmail.com","Aksh@gmail.com"]})

In [72]:
df

            Email
0   abc@gmail.com
1   def@gmail.com
2  Aksh@gmail.com

In [76]:
def extract_name(s):
    ans="";
    for i in s:
     
        if i=='@':
            break;
        ans+=i;
    return ans;


df['Username']=df['Email'].apply(extract_name)

In [77]:
df

            Email Username
0   abc@gmail.com      abc
1   def@gmail.com      def
2  Aksh@gmail.com     Aksh

In [89]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that 
# selects all rows where the value in column 'A' is greater than 5 and the value in 
# column 'B' is less than 10. The function should return a new DataFrame that 
# contains only the selected rows.

d={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}

In [90]:
df=pd.DataFrame(d)

In [91]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [92]:
df=df[(df["A"]>5) & (df["B"]<10)]

In [93]:
df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [97]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to 
# calculate the mean, median, and standard deviation of the values in the 'Values' column.

df=pd.DataFrame({"Values":[10,20,33,40,50]})
df

   Values
0      10
1      20
2      33
3      40
4      50

In [98]:
df["Values"].mean()

30.6

In [99]:
df["Values"].median()

33.0

In [101]:
df["Values"].std()

15.868207208125309

In [107]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write 
# a Python function to create a new column 'MovingAverage' that contains the moving 
# average of the sales for the past 7 days for each row in the DataFrame. The moving 
# average should be calculated using a window of size 7 and should include the current day.
date=pd.date_range(start='2023-04-23',end='2023-05-23')
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23'],
              dtype='datetime64[ns]', freq='D')

In [108]:
df=pd.DataFrame({"Sales":[i for i in range(len(date))],"Date":date})

In [109]:
df

    Sales       Date
0       0 2023-04-23
1       1 2023-04-24
2       2 2023-04-25
3       3 2023-04-26
4       4 2023-04-27
5       5 2023-04-28
6       6 2023-04-29
7       7 2023-04-30
8       8 2023-05-01
9       9 2023-05-02
10     10 2023-05-03
11     11 2023-05-04
12     12 2023-05-05
13     13 2023-05-06
14     14 2023-05-07
15     15 2023-05-08
16     16 2023-05-09
17     17 2023-05-10
18     18 2023-05-11
19     19 2023-05-12
20     20 2023-05-13
21     21 2023-05-14
22     22 2023-05-15
23     23 2023-05-16
24     24 2023-05-17
25     25 2023-05-18
26     26 2023-05-19
27     27 2023-05-20
28     28 2023-05-21
29     29 2023-05-22
30     30 2023-05-23

In [110]:
df["Sales"].rolling(window=7).mean()

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6      3.0
7      4.0
8      5.0
9      6.0
10     7.0
11     8.0
12     9.0
13    10.0
14    11.0
15    12.0
16    13.0
17    14.0
18    15.0
19    16.0
20    17.0
21    18.0
22    19.0
23    20.0
24    21.0
25    22.0
26    23.0
27    24.0
28    25.0
29    26.0
30    27.0
Name: Sales, dtype: float64

In [112]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.


df=pd.DataFrame({"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [113]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [114]:
df["Date"]=pd.to_datetime(df['Date'])

In [115]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [116]:
df.dtypes

Date    datetime64[ns]
dtype: object

In [121]:
df["Weekday"]=df["Date"].dt.day_name()

In [131]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [133]:
#Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

mask = (df['date'] > start_date) & (df['date'] <= end_date)

In [134]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
# be imported?

import pandas